package day4;

public class Ex402 {
	public static void main(String[] args) {
		int n = 0b0011; // 3 = 00000000 00000000 000000000 00000011
		n = n << 1; // "<<1" --->왼쪽으로 1비트씩 이동!
		System.out.println(n); //6
		
		int a = 0x00000008; // 16진수는 두 자리가 1바이트!
				// = 00000000 00000000 00000000 00001000
		a = a >> 1; // ">>1"은 빈자리가 MSB로 채워짐.
				// = 00000000 00000000 00000000 00000100
		System.out.println(a);
		
		int b = 0xffffff80;
				// = 11111111 11111111 11111111 10000000
		b = b >> 1; //">>1": 빈 자리를 MSB(=1)로 채움.
				// = 11111111 11111111 11111111 11000000
		System.out.println(b);
		
		b = b >>> 1;
				// = 01111111 1111111 11111111 11100000 // 2147483616
		System.out.println(b);
		//참고.
		int c  = 0b01111111_11111111_11111111_11100000;
		System.out.println(c);
	}

}
